drop table if exists temp_countries;
create temp table temp_countries (name              text not null   --наименование
                                 ,parent_id         int  not null   --идентификатор родителя
                                 ,countries_type_id int  not null); --идентификатор объекта
                                 
do $$
declare v_parent_id int := fnct_get_countries_id('Российская Федерация');
        elem        json;
        list        json := '[
  {"name":"Республика Адыгея","type":"Республика"},
  {"name":"Республика Алтай","type":"Республика"},
  {"name":"Республика Башкортостан","type":"Республика"},
  {"name":"Республика Бурятия","type":"Республика"},
  {"name":"Республика Дагестан","type":"Республика"},
  {"name":"Республика Ингушетия","type":"Республика"},
  {"name":"Кабардино-Балкарская Республика","type":"Республика"},
  {"name":"Республика Калмыкия","type":"Республика"},
  {"name":"Карачаево-Черкесская Республика","type":"Республика"},
  {"name":"Республика Карелия","type":"Республика"},
  {"name":"Республика Коми","type":"Республика"},
  {"name":"Республика Марий Эл","type":"Республика"},
  {"name":"Республика Мордовия","type":"Республика"},
  {"name":"Республика Саха (Якутия)","type":"Республика"},
  {"name":"Республика Северная Осетия — Алания","type":"Республика"},
  {"name":"Республика Татарстан","type":"Республика"},
  {"name":"Республика Тыва","type":"Республика"},
  {"name":"Удмуртская Республика","type":"Республика"},
  {"name":"Республика Хакасия","type":"Республика"},
  {"name":"Чеченская Республика","type":"Республика"},
  {"name":"Чувашская Республика","type":"Республика"},
  {"name":"Алтайский край","type":"Край"},
  {"name":"Забайкальский край","type":"Край"},
  {"name":"Камчатский край","type":"Край"},
  {"name":"Краснодарский край","type":"Край"},
  {"name":"Красноярский край","type":"Край"},
  {"name":"Пермский край","type":"Край"},
  {"name":"Приморский край","type":"Край"},
  {"name":"Ставропольский край","type":"Край"},
  {"name":"Хабаровский край","type":"Край"},
  {"name":"Амурская область","type":"Область"},
  {"name":"Архангельская область","type":"Область"},
  {"name":"Астраханская область","type":"Область"},
  {"name":"Белгородская область","type":"Область"},
  {"name":"Брянская область","type":"Область"},
  {"name":"Владимирская область","type":"Область"},
  {"name":"Волгоградская область","type":"Область"},
  {"name":"Вологодская область","type":"Область"},
  {"name":"Воронежская область","type":"Область"},
  {"name":"Ивановская область","type":"Область"},
  {"name":"Иркутская область","type":"Область"},
  {"name":"Калининградская область","type":"Область"},
  {"name":"Калужская область","type":"Область"},
  {"name":"Кемеровская область","type":"Область"},
  {"name":"Кировская область","type":"Область"},
  {"name":"Костромская область","type":"Область"},
  {"name":"Курганская область","type":"Область"},
  {"name":"Курская область","type":"Область"},
  {"name":"Ленинградская область","type":"Область"},
  {"name":"Липецкая область","type":"Область"},
  {"name":"Магаданская область","type":"Область"},
  {"name":"Московская область","type":"Область"},
  {"name":"Мурманская область","type":"Область"},
  {"name":"Нижегородская область","type":"Область"},
  {"name":"Новгородская область","type":"Область"},
  {"name":"Новосибирская область","type":"Область"},
  {"name":"Омская область","type":"Область"},
  {"name":"Оренбургская область","type":"Область"},
  {"name":"Орловская область","type":"Область"},
  {"name":"Пензенская область","type":"Область"},
  {"name":"Псковская область","type":"Область"},
  {"name":"Ростовская область","type":"Область"},
  {"name":"Рязанская область","type":"Область"},
  {"name":"Самарская область","type":"Область"},
  {"name":"Саратовская область","type":"Область"},
  {"name":"Сахалинская область","type":"Область"},
  {"name":"Свердловская область","type":"Область"},
  {"name":"Смоленская область","type":"Область"},
  {"name":"Тамбовская область","type":"Область"},
  {"name":"Тверская область","type":"Область"},
  {"name":"Томская область","type":"Область"},
  {"name":"Тульская область","type":"Область"},
  {"name":"Тюменская область","type":"Область"},
  {"name":"Ульяновская область","type":"Область"},
  {"name":"Челябинская область","type":"Область"},
  {"name":"Ярославская область","type":"Область"},
  {"name":"Москва","type":"Город федерального значения"},
  {"name":"Санкт-Петербург","type":"Город федерального значения"},
  {"name":"Севастополь","type":"Город федерального значения"},
  {"name":"Еврейская автономная область","type":"Автономная область"},
  {"name":"Чукотский автономный округ","type":"Автономный округ"},
  {"name":"Ханты-Мансийский автономный округ — Югра","type":"Автономный округ"},
  {"name":"Ямало-Ненецкий автономный округ","type":"Автономный округ"},
  {"name":"Ненецкий автономный округ","type":"Автономный округ"}
]';
begin
  for elem in select json_array_elements(list)
  loop
    insert into temp_countries (name, parent_id, countries_type_id)
    values (elem ->> 'name', v_parent_id, fnct_get_countries_type_id(elem ->> 'type'));
  end loop;

  call proc_mass_insert_countries();  
end
$$;